[
  {
    "id": 1,
    "productName": "Engine Oil Filter",
    "image": "https://i.ibb.co/KywT9cp/download-4.jpg",
    "price": 16,
    "productDetails": "The engine oil filter is a crucial component for maintaining your vehicle's engine health. It helps to remove contaminants from the oil, ensuring proper lubrication and preventing premature wear and tear. Made from high-quality materials, our engine oil filters are designed to meet or exceed OEM specifications. With a durable construction and reliable performance, you can trust our filters to keep your engine running smoothly.",
    "rating": 4
  },
  {
    "id": 2,
    "productName": "Brake Pads",
    "image": "https://i.ibb.co/PZRy2dS/download.jpg",
    "price": 40,
    "productDetails": "Brake pads are essential for safe driving, as they provide the necessary friction to slow down or stop your vehicle. Our brake pads are manufactured using advanced materials and technology to deliver superior stopping power and durability. Whether you're commuting to work or hitting the racetrack, our brake pads offer consistent performance and reliability. Plus, they're easy to install, so you can get back on the road quickly.",
    "rating": 5
  },
  {
    "id": 3,
    "productName": "Air Filter",
    "image": "https://i.ibb.co/HzqmtgZ/download-1.jpg",
    "price": 12,
    "productDetails": "The air filter plays a vital role in your vehicle's engine performance by preventing dirt, dust, and debris from entering the intake system. Our air filters are engineered to maximize airflow while providing exceptional filtration efficiency. With regular replacement, you can ensure...",
    "rating": 4
  },
  {
    "id": 4,
    "productName": "Spark Plugs",
    "image": "https://i.ibb.co/wgQw0Y2/download-2.jpg",
    "price": 8,
    "productDetails": "Spark plugs are essential for igniting the air-fuel mixture in your engine's cylinders. Our spark plugs are designed for optimal performance and longevity, ensuring smooth engine operation and fuel efficiency. With a durable construction and reliable spark, you can count on our spark plugs to keep your engine running at its best.",
    "rating": 4
  },
  {
    "id": 5,
    "productName": "Wiper Blades",
    "image": "https://i.ibb.co/GRkh2y0/download-3.jpg",
    "price": 18,
    "productDetails": "Clear visibility is crucial for safe driving, especially in adverse weather conditions. Our wiper blades are engineered to provide streak-free wiping performance and long-lasting durability. With easy installation and a snug fit, our wiper blades ensure clear visibility and improved safety on the road.",
    "rating": 5
  },
  {
    "id": 6,
    "productName": "Battery",
    "image": "https://i.ibb.co/qgcKQ00/download-5.jpg",
    "price": 90,
    "productDetails": "A reliable battery is essential for starting your vehicle and powering its electrical components. Our car batteries are designed to deliver consistent performance and reliable starting power, even in extreme temperatures. With advanced technology and durable construction, you can trust our batteries to keep your vehicle running smoothly.",
    "rating": 5
  },
  {
    "id": 7,
    "productName": "Shock Absorbers",
    "image": "https://i.ibb.co/5nthkFs/download-6.jpg",
    "price": 65,
    "productDetails": "Shock absorbers play a critical role in your vehicle's suspension system, providing a smooth and comfortable ride. Our shock absorbers are engineered to absorb bumps and vibrations from the road, ensuring stable handling and enhanced driver control. With durable construction and precise engineering, our shock absorbers deliver reliable performance mile after mile.",
    "rating": 4
  },
  {
    "id": 8,
    "productName": "Fuel Pump",
    "image": "https://i.ibb.co/xGWyJcL/download-7.jpg",
    "price": 55,
    "productDetails": "The fuel pump is responsible for delivering fuel from the tank to the engine's fuel injectors at the proper pressure. Our fuel pumps are designed for precise fuel delivery and reliable performance, ensuring optimal engine efficiency and power. With advanced technology and durable construction, you can trust our fuel pumps to keep your vehicle running smoothly.",
    "rating": 4
  },
  {
    "id": 9,
    "productName": "Radiator",
    "image": "https://i.ibb.co/C0P3Xhr/download-8.jpg",
    "price": 120,
    "productDetails": "The radiator is a crucial component of your vehicle's cooling system, responsible for dissipating heat generated by the engine. Our radiators are engineered for efficient heat transfer and reliable cooling performance, ensuring optimal engine temperature and preventing overheating. With durable construction and precise fitment, you can trust our radiators to keep your engine running smoothly.",
    "rating": 5
  },
  {
    "id": 10,
    "productName": "Oxygen Sensor",
    "image": "https://i.ibb.co/C5hysBd/download-9.jpg",
    "price": 25,
    "productDetails": "The oxygen sensor monitors the oxygen levels in your vehicle's exhaust gases, helping to ensure proper fuel combustion and reduce harmful emissions. Our oxygen sensors are engineered for accurate readings and long-lasting durability, ensuring optimal engine performance and fuel efficiency. With easy installation and precise fitment, you can trust our oxygen sensors to keep your vehicle running smoothly.",
    "rating": 4
  },
  {
    "id": 11,
    "productName": "Cabin Air Filter",
    "image": "https://i.ibb.co/Xjy5SzP/images.jpg",
    "price": 20,
    "productDetails": "The cabin air filter is responsible for cleaning the air that enters the interior of your vehicle through the HVAC system. It removes dust, pollen, and other airborne contaminants, ensuring clean and fresh air for you and your passengers. Our cabin air filters are designed for maximum filtration efficiency and airflow, providing a healthier and more comfortable driving experience.",
    "rating": 5
  },
  {
    "id": 12,
    "productName": "Tire Pressure Gauge",
    "image": "https://i.ibb.co/WGTGBc4/download.jpg",
    "price": 10,
    "productDetails": "Maintaining the correct tire pressure is essential for optimal tire performance, fuel efficiency, and safety. Our tire pressure gauge allows you to quickly and accurately measure tire pressure, ensuring proper inflation levels. With a compact and durable design, our tire pressure gauge is easy to use and built to last.",
    "rating": 4
  },
  {
    "id": 13,
    "productName": "Car Wash Soap",
    "image": "https://i.ibb.co/mrs3scv/download-1.jpg",
    "price": 15,
    "productDetails": "Keep your vehicle looking its best with our premium car wash soap. Formulated to safely and effectively remove dirt, grime, and road debris, our car wash soap leaves your vehicle with a streak-free shine. Plus, it's gentle on paint and finishes, so you can wash your car with confidence.",
    "rating": 4
  },
  {
    "id": 14,
    "productName": "Wheel Cleaner",
    "image": "https://i.ibb.co/Dzqv5d4/download-2.jpg",
    "price": 12,
    "productDetails": "Restore the shine to your wheels with our powerful wheel cleaner. Designed to break down brake dust, road grime, and other contaminants, our wheel cleaner leaves your wheels looking like new. With a gentle formula that's safe for all wheel finishes, you can trust our wheel cleaner to deliver professional results.",
    "rating": 5
  },
  {
    "id": 15,
    "productName": "Car Wax",
    "image": "https://i.ibb.co/0yDyDPH/download-3.jpg",
    "price": 25,
    "productDetails": "Protect your vehicle's paint and enhance its shine with our high-quality car wax. Formulated with advanced polymers and UV inhibitors, our car wax provides long-lasting protection against the elements. Easy to apply and buff to a high gloss finish, our car wax is the perfect way to keep your vehicle looking its best.",
    "rating": 4
  },
  {
    "id": 16,
    "productName": "Headlight Restoration Kit",
    "image": "https://i.ibb.co/bF5qyRy/download-4.jpg",
    "price": 30,
    "productDetails": "Improve visibility and safety on the road with our headlight restoration kit. Designed to remove oxidation, yellowing, and haze from headlights, our kit restores clarity and brightness to your headlights for better nighttime driving. With easy-to-follow instructions and all the necessary tools included, you can restore your headlights to like-new condition in no time.",
    "rating": 4
  },
  {
    "id": 17,
    "productName": "Car Floor Mats",
    "image": "https://i.ibb.co/ftPV4HB/download-5.jpg",
    "price": 35,
    "productDetails": "Protect your vehicle's interior from dirt, spills, and wear with our durable car floor mats. Made from high-quality materials and custom fit for your vehicle, our floor mats provide superior coverage and protection. Plus, they're easy to clean and maintain, so you can keep your vehicle looking its best.",
    "rating": 5
  },
  {
    "id": 18,
    "productName": "Car Battery Charger",
    "image": "https://i.ibb.co/wJHvY0k/download-6.jpg",
    "price": 50,
    "productDetails": "Ensure your vehicle's battery is always charged and ready to go with our car battery charger. Featuring automatic charging technology and multiple charging modes, our charger is suitable for all types of 12-volt lead-acid batteries. With built-in safety features and a compact design, you can trust our battery charger to keep your battery in peak condition.",
    "rating": 5
  },
  {
    "id": 19,
    "productName": "Car Jack",
    "image": "https://i.ibb.co/rQcqJbP/download-7.jpg",
    "price": 45,
    "productDetails": "Change tires and perform maintenance tasks with ease using our heavy-duty car jack. Constructed from durable steel and equipped with a lifting range suitable for most vehicles, our car jack provides reliable support and stability. With a compact design for easy storage in your trunk or garage, our car jack is a must-have for any vehicle owner.",
    "rating": 4
  },
  {
    "id": 20,
    "productName": "Transmission Fluid",
    "image": "https://i.ibb.co/fHKLCG1/download-8.jpg",
    "price": 18,
    "productDetails": "Ensure smooth shifting and optimal performance with our premium transmission fluid. Formulated to meet or exceed manufacturer specifications, our transmission fluid provides excellent lubrication and heat resistance for your vehicle's transmission. With regular fluid changes, you can extend the life of your transmission and avoid costly repairs.",
    "rating": 4
  },
  {
    "id": 21,
    "productName": "Car Cover",
    "image": "https://i.ibb.co/VpT7ZpH/download-9.jpg",
    "price": 50,
    "productDetails": "Protect your vehicle from the elements with our durable car cover. Made from weather-resistant materials and featuring a soft inner lining, our car cover shields your vehicle from rain, snow, UV rays, and more. With a secure fit and built-in grommets for tie-downs, you can trust our car cover to keep your vehicle looking its best.",
    "rating": 5
  },
  {
    "id": 22,
    "productName": "Car Seat Covers",
    "image": "https://i.ibb.co/GsSx4G5/download-10.jpg",
    "price": 40,
    "productDetails": "Upgrade your vehicle's interior with our stylish and comfortable car seat covers. Made from premium materials and featuring a universal fit design, our seat covers protect your seats from spills, stains, and wear. With easy installation and machine washable fabric, our seat covers are perfect for adding a personal touch to your vehicle.",
    "rating": 4
  },
  {
    "id": 23,
    "productName": "Car Polish",
    "image": "https://i.ibb.co/WFMTmCg/download-11.jpg",
    "price": 20,
    "productDetails": "Achieve a showroom shine with our professional-grade car polish. Formulated to remove swirl marks, fine scratches, and oxidation, our car polish restores the luster to your vehicle's paintwork. Easy to apply and buff to a high gloss finish, our car polish leaves your vehicle looking like new.",
    "rating": 4
  },
  {
    "id": 24,
    "productName": "Wheel Alignment Kit",
    "image": "https://i.ibb.co/gwkMss6/download.jpg",
    "price": 100,
    "productDetails": "Ensure proper tire wear and handling with our precision wheel alignment kit. Designed for DIY enthusiasts and professional mechanics alike, our kit includes everything you need to accurately measure and adjust toe, camber, and caster angles. With easy-to-follow instructions and durable construction, you can achieve optimal wheel alignment for improved driving performance.",
    "rating": 5
  },
  {
    "id": 25,
    "productName": "Car Diagnostic Scanner",
    "image": "https://i.ibb.co/3FkqcfM/download-1.jpg",
    "price": 80,
    "productDetails": "Diagnose engine problems and monitor vehicle performance with our advanced car diagnostic scanner. Compatible with OBD-II compliant vehicles, our scanner retrieves trouble codes, reads live data streams, and performs comprehensive system tests. With a user-friendly interface and real-time updates, our scanner is an essential tool for automotive enthusiasts and professional mechanics.",
    "rating": 4
  },
  {
    "id": 26,
    "productName": "Fuel Injector Cleaner",
    "image": "https://i.ibb.co/GHQ4QtP/images.jpg",
    "price": 15,
    "productDetails": "Improve fuel efficiency and engine performance with our powerful fuel injector cleaner. Formulated to remove carbon deposits and varnish buildup from fuel injectors, our cleaner restores injector flow and atomization for optimal fuel delivery. With regular use, you can keep your fuel system clean and maintain peak engine performance.",
    "rating": 4
  },
  {
    "id": 27,
    "productName": "Car GPS Tracker",
    "image": "https://i.ibb.co/xCPJGGm/download-2.jpg",
    "price": 60,
    "productDetails": "Track your vehicle's location and monitor its movements with our reliable car GPS tracker. Featuring real-time tracking and geo-fencing capabilities, our tracker provides peace of mind knowing your vehicle is safe and secure. With easy installation and a user-friendly mobile app, you can keep tabs on your vehicle from anywhere.",
    "rating": 5
  },
  {
    "id": 28,
    "productName": "Car Emergency Kit",
    "image": "https://i.ibb.co/sFHrhdG/download-3.jpg",
    "price": 30,
    "productDetails": "Be prepared for roadside emergencies with our comprehensive car emergency kit. Packed with essential tools and supplies, including jumper cables, a flashlight, first aid supplies, and more, our kit helps you handle unexpected breakdowns and accidents. Compact and portable, our emergency kit fits neatly in your trunk or glove compartment for peace of mind on the road.",
    "rating": 5
  },
  {
    "id": 29,
    "productName": "Car Jump Starter",
    "image": "https://i.ibb.co/HdCQmRq/download-4.jpg",
    "price": 70,
    "productDetails": "Never get stranded with a dead battery again with our powerful car jump starter. Compact yet powerful, our jump starter delivers enough power to start most vehicles, including cars, trucks, and SUVs. With built-in safety features and a built-in LED flashlight, our jump starter is a must-have for every vehicle.",
    "rating": 4
  },
  {
    "id": 30,
    "productName": "Car Trash Can",
    "image": "https://i.ibb.co/mXJdnBm/download-5.jpg",
    "price": 15,
    "productDetails": "Keep your vehicle clean and organized with our convenient car trash can. Designed to fit in your car's cup holder or attach to the seat, our trash can is perfect for disposing of wrappers, tissues, and other small trash items. With a leak-proof design and easy-to-clean liner, our trash can is a practical solution for keeping your car tidy.",
    "rating": 4
  }
]
